jifanchn/micropython-papers3m5/papers3/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME               "Papers3M5 ESP32S3-N16R8"
#define MICROPY_HW_MCU_NAME                 "ESP32S3"

// Enable UART REPL for modules that have an external USB-UART and don't use native USB.
#define MICROPY_HW_ENABLE_UART_REPL         (1) 